projects/electroChemTest/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
(
    H2O
    CO2
    H2
    O2
    Hplus
    OHminus
    Acetate // CH3COOminus
);

inertSpecie H2O;

FaradayConstant 96485.3329;

absolutePressureReference 101325;

temperature 298.15;

diffusivity 
{
    H2O     2.3e-9;
    CO2     1.95e-9;
    H2      3.2e-9;
    O2      3.49e-9;
    OHminus 9.31e-9;
    Hplus   5.27e-9;
    Acetate 1.10e-9;
}   

molarMass 
{
    H2O     0.018015;
    CO2     0.044009;
    H2      0.002016;
    O2      0.031998;
    OHminus 0.017007;
    Hplus   0.0010080;
    Acetate 0.059044;   
}   

chargeNumber
{
    Hplus    1;
    OHminus -1;
    Acetate -1;
}

henryConstant // [mol/m3 Pa]
{
    CO2 3.4e-4;
    H2  7.8e-6;
    O2  1.3e-5;
}

// Potential field
phiERef     0;
phiEOrigin  (0 0 0);
gradPhiE    (0 -100.0 0);  // V/m

reactions
{
    acetogenesis
    {
        type          multiplicativeMonod;

        stoichiometry
        {
            CO2     -2;
            H2      -4;
            Acetate  1;
            Hplus    1;
            H2O      2;
        }

        substrates   (H2 CO2);
        K            (0.02 0.02);       // mol/m3, same order as substrates
        qMax         2.31e-3;           // mol/kgDW s, or define your own unit
        X            50;                // kgDW/m3
    }

    // waterEquilibrium
    // {
    //     type waterEquilibrium;
        
    //     Hplus       Hplus;
    //     OHminus     OHminus;
        
    //     Kw          1e-8; // Kw = 10^-14 (mol/L)^2  = 10^-8 (mol/m3)^2
    // }
}


// ************************************************************************* //

