projects/electroChemTest/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
10000
(
(0.0005 1.00166e-05 0.00025)
(0.0005 3.03843e-05 0.00025)
(0.0005 5.14321e-05 0.00025)
(0.0005 7.31827e-05 0.00025)
(0.0005 9.56596e-05 0.00025)
(0.0005 0.000118887 0.00025)
(0.0005 0.00014289 0.00025)
(0.0005 0.000167695 0.00025)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(0.0005 1.00166e-05 0)
(0.0005 3.03843e-05 0)
(0.0005 5.14321e-05 0)
(0.0005 7.31827e-05 0)
(0.0005 9.56596e-05 0)
(0.0005 0.000118887 0)
(0.0005 0.00014289 0)
(0.0005 0.000167695 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(0.0005 1.00166e-05 0.05)
(0.0005 3.03843e-05 0.05)
(0.0005 5.14321e-05 0.05)
(0.0005 7.31827e-05 0.05)
(0.0005 9.56596e-05 0.05)
(0.0005 0.000118887 0.05)
(0.0005 0.00014289 0.05)
(0.0005 0.000167695 0.05)
...
)
;
    }
    cathode
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(0.0005 0 0.00025)
(0.0005 0 0.00075)
(0.0005 0 0.00125)
(0.0005 0 0.00175)
(0.0005 0 0.00225)
(0.0005 0 0.00275)
(0.0005 0 0.00325)
(0.0005 0 0.00375)
...
)
;
    }
    anode
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(0.0005 0.005 0.00025)
(0.0005 0.005 0.00075)
(0.0005 0.005 0.00125)
(0.0005 0.005 0.00175)
(0.0005 0.005 0.00225)
(0.0005 0.005 0.00275)
(0.0005 0.005 0.00325)
(0.0005 0.005 0.00375)
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
20000
(
(0 1.00166e-05 0.00025)
(0 3.03843e-05 0.00025)
(0 5.14321e-05 0.00025)
(0 7.31827e-05 0.00025)
(0 9.56596e-05 0.00025)
(0 0.000118887 0.00025)
(0 0.00014289 0.00025)
(0 0.000167695 0.00025)
...
)
;
    }
}


// ************************************************************************* //
