projects/electroChemTest/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;
    }
    cathode
    {
        type            calculated;
        value           uniform 0.0005;
    }
    anode
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
20000
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
