projects/electroChemTest/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
    cathode
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.00025
0.00075
0.00125
0.00175
0.00225
0.00275
0.00325
0.00375
...
)
;
    }
    anode
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.00025
0.00075
0.00125
0.00175
0.00225
0.00275
0.00325
0.00375
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
20000
(
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
...
)
;
    }
}


// ************************************************************************* //
