projects/electroChemTest/0/c_CO2
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CO2;
}

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 22.72;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    cathode
    {
        type            zeroGradient;
    }

    anode
    {
        type            zeroGradient;
    }
}
