projects/electroChemTest/0/c_H2O
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2O;
}

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 55453;
        // type            inertMassFraction;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    // use calculate to enforce species conservation at boundaries as zerogradient overwrites this value otherwise
    cathode
    {
        type            calculated;
        value           uniform 55500;
    }

    anode
    {
        type            calculated;
        value           uniform 55500;
    }
}
